

"""
while True:
    sentence = input("Введите предложение: ")
    s = sentence.split()
    print (s)
    for slovo in s:
        slovo1 = slovo.lower().strip("!:?,;")
        if len(slovo1)>5:
            print (slovo1) 
    else:
        break

"""

#грузинская транслитерация

trans = {"ა": "а", "ბ": "б",
         "გ": "г", "დ": "д",
         "ე": "э", "ვ": "в",
         "ზ": "з", "თ": "т",
         "ჱ": "е", "ი": "и",
         "კ": "к", "ლ": "л",
         "მ": "м", "ნ": "н",
         "ჲ": "й", "ბ": "о",
         "ა": "п", "ბ": "ж",
         "ა": "р", "ბ": "с",
         "ა": "т", "ბ": "в",
         "ა": "у", "ბ": "е",
         "ა": "р", "ბ": "к",
         "ა": "г", "ბ": "к",
         "ა": "ъ", "ბ": "ш",
         "ა": "ч", "ბ": "ц",
         "ა": "дз", "ბ": "ц",
         "ა": "ч", "ბ": "х",
         "ა": "х", "ბ": "дж",
         "ჶ": "х"}


word = input()
for letter in word:
	if letter in trans:
		print(trans[letter])
	




























